<?
    $getCountPhoto = $db->query("SELECT count(*) FROM `photo`")->fetch();
    $getLikes = $db->query("SELECT SUM(`likes`) FROM `photo`")->fetch();
?>

<main class="main-area">
    <h2>Общая статистика по сайту</h2>
    <hr>

    <div class="static">
        <div class="card-item">
            <svg width="64" viewBox="0 0 512 512" style="enable-background:new 0 0 512 512;" xml:space="preserve"><g><g><g><path fill="#1cbd7f" d="M480,96H128c-17.673,0-32,14.327-32,32v352c0,17.673,14.327,32,32,32h352c17.673,0,32-14.327,32-32V128C512,110.327,497.673,96,480,96z M480,480H128V128h352V480z"/><path fill="#1cbd7f" d="M32,32h352v32h32V32c0-17.673-14.327-32-32-32H32C14.327,0,0,14.327,0,32v352c0,17.673,14.327,32,32,32h32v-32H32V32z"/><path fill="#1cbd7f" d="M176,400h256c8.836,0.051,16.041-7.07,16.093-15.907c0.025-4.299-1.681-8.426-4.733-11.453l-64-64c-6.241-6.204-16.319-6.204-22.56,0l-20.8,20.8l-52.64-52.64c-6.241-6.204-16.319-6.204-22.56,0l-96,96c-6.186,6.31-6.087,16.44,0.223,22.626C167.959,398.304,171.889,399.942,176,400z"/><circle fill="#1cbd7f" cx="384" cy="240" r="32"/></g></g></g><g></g><g></g><g></g><g></g><g></g><g></g><g></g><g></g><g></g><g></g><g></g><g></g><g></g><g></g><g></g></svg>
            <p>Всего фотографий <br><span><?=$getCountPhoto[0]?> шт</span></p>
        </div>
        <div class="card-item">
            <svg width="64" height="64" viewBox="0 0 32 30" fill="none" xmlns="http://www.w3.org/2000/svg"><path data-id="57" d="M29.4614 3.53613C27.8049 1.7395 25.532 0.75 23.0608 0.75C21.2136 0.75 19.522 1.33398 18.0327 2.4856C17.2812 3.06689 16.6003 3.77808 16 4.60815C15.3999 3.77832 14.7188 3.06689 13.967 2.4856C12.478 1.33398 10.7864 0.75 8.93921 0.75C6.46802 0.75 4.19482 1.7395 2.53833 3.53613C0.901611 5.31177 0 7.73755 0 10.3669C0 13.0732 1.00854 15.5505 3.17383 18.1633C5.11084 20.5005 7.89478 22.873 11.1187 25.6204C12.2195 26.5586 13.4673 27.6221 14.7629 28.7549C15.1052 29.0547 15.5444 29.2197 16 29.2197C16.4553 29.2197 16.8948 29.0547 17.2366 28.7554C18.5322 27.6223 19.7808 26.5583 20.8821 25.6196C24.1055 22.8728 26.8894 20.5005 28.8264 18.1631C30.9917 15.5505 32 13.0732 32 10.3667C32 7.73755 31.0984 5.31177 29.4614 3.53613Z" fill="url(#paint0_linear)"></path><defs><linearGradient id="paint0_linear" x1="16" y1="0.75" x2="16" y2="29.2197" gradientUnits="userSpaceOnUse"><stop stop-color="#F81F01"></stop><stop offset="1" stop-color="#EE076E"></stop></linearGradient></defs></svg>
            <p>Всего лайков <br><span><?=$getLikes[0]?></span></p>
        </div>
    </div>
</main>